IdeaRS.OpenModel.Material.MatSteelEc2
Material steel Ec2
This sample shows how to create steel material.
//Creating the model
OpenModel openModel = new OpenModel();
//Steel material
MatSteelEc2 matS = new MatSteelEc2();
matS.Name = "S275";
matS.UnitMass = 7850.0;
matS.E = 200e9;
matS.Poisson = 0.2;
matS.G = 83.333e9;
matS.SpecificHeat = 0.6;
matS.ThermalExpansion = 0.00001;
matS.ThermalConductivity = 45;
matS.fy = 235e6;
matS.fu = 360e6;
matS.fy40 = 215e6;
matS.fu40 = 340e6;
//Setting thermal characteristcs of material (in this case by the code)
matS.StateOfThermalConductivity = ThermalConductivityState.Code;
matS.StateOfThermalExpansion = ThermalExpansionState.Code;
matS.StateOfThermalSpecificHeat = ThermalSpecificHeatState.Code;
matS.StateOfThermalStressStrain = ThermalStressStrainState.Code;
matS.DiagramType = SteelDiagramType.Bilinear;
openModel.AddObject(matS);

IdeaRS.OpenModel.Material.MatSteelEc2.fy
Yield strength for nominal thickness of the element <= 40mm - fy

IdeaRS.OpenModel.Material.MatSteelEc2.fu
Ultimate strength  for nominal thickness of the element <= 40mm - fu

IdeaRS.OpenModel.Material.MatSteelEc2.fy40
Yield strength for nominal thickness of the element > 40mm and <= 100mm - fy,(>40)

IdeaRS.OpenModel.Material.MatSteelEc2.fu40
Ultimate strength for nominal thickness of the element > 40mm and <= 100mm - fu,(>40)

IdeaRS.OpenModel.Material.MatSteelEc2.DiagramType
Type of material diagram

IdeaRS.OpenModel.Material.MatSteelEc2.UserDiagram
Stress-strain diagram defined by user